Revit 2026 API

# PanelScheduleDataSetLoadClassifications Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLoadClassifications(
	IList<ElementId> loadClassificaions
)
```
```vb
Public Sub SetLoadClassifications (
	loadClassificaions As IList(Of ElementId)
)
```
```cpp
public:
void SetLoadClassifications(
	IList<ElementId^>^ loadClassificaions
)
```
```fsharp
member SetLoadClassifications :
        loadClassificaions : IList<ElementId> -> unit
```

#### Parameters

loadClassificaions IListElementId

#### Reference

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace